#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/EATechSolutions/PersonalWebsite/runs/run-LoBJYLTHmE8zVrtd

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
module.website.random_string.postfix: Refreshing state... [id=nuhwyr]
module.website.aws_s3_bucket.website: Refreshing state... [id=personalwebsite.prod.website.nuhwyr]
module.ssm_parameters.aws_ssm_parameter._["website_s3_bucket"]: Refreshing state... [id=/personalwebsite/prod/website_s3_bucket]
module.website.aws_s3_bucket_policy._: Refreshing state... [id=personalwebsite.prod.website.nuhwyr]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ssm_parameters.aws_ssm_parameter._["website_s3_bucket"] will be updated in-place
  ~ resource "aws_ssm_parameter" "_" {
        id        = "/personalwebsite/prod/website_s3_bucket"
        name      = "/personalwebsite/prod/website_s3_bucket"
        tags      = {}
      ~ value     = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.website.data.template_file._ will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "_"  {
      ~ id       = "c48f0e9b02b54c55397871ecf2d173c0b83887abfda41ddcbd597d758452c303" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::personalwebsite.prod.website.nuhwyr/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ vars     = {
          ~ "s3_bucket_arn" = "arn:aws:s3:::personalwebsite.prod.website.nuhwyr" -> (known after apply)
        }
        # (1 unchanged attribute hidden)
    }

  # module.website.aws_s3_bucket.website must be replaced
-/+ resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::personalwebsite.prod.website.nuhwyr" -> (known after apply)
      ~ bucket                      = "personalwebsite.prod.website.nuhwyr" -> "elroyantao.com" # forces replacement
      ~ bucket_domain_name          = "personalwebsite.prod.website.nuhwyr.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "personalwebsite.prod.website.nuhwyr.s3.eu-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3GKZC51ZF0DB4" -> (known after apply)
      ~ id                          = "personalwebsite.prod.website.nuhwyr" -> (known after apply)
      ~ region                      = "eu-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website.eu-west-2.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "personalwebsite.prod.website.nuhwyr.s3-website.eu-west-2.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
            # (2 unchanged attributes hidden)
        }
    }

  # module.website.aws_s3_bucket_policy._ must be replaced
-/+ resource "aws_s3_bucket_policy" "_" {
      ~ bucket = "personalwebsite.prod.website.nuhwyr" -> (known after apply) # forces replacement
      ~ id     = "personalwebsite.prod.website.nuhwyr" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::personalwebsite.prod.website.nuhwyr/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Quoted type constraints are deprecated

  on .terraform/modules/website/s3-static-website/variables.tf line 12, in variable "bucket_name":
  12:   type        = "string"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "string".

```
</details>
*Pusher: @elroyantao, Action: `pull_request`*